import Foundation

/*  1. Объявите две целочисленные переменные типов Int8 и UInt8. В одну из них запишите максимальное значение, которое может принять параметр типа UInt8, в другую — минимальное значение, которое может принять параметр типа Int8. Обратите внимание на то, какое значение в какую переменную может быть записано.
    2. Выведите полученные значения на консоль. */

var intNum: Int8 = .min
var uintNum: UInt8 = .max

print("Минимальное значение, которое может принять параметр типа Int8: \(intNum), максимальное значение, которое может принять параметр типа UInt8: \(uintNum)")
